package lv4;

public class Ex03_13tc {

	public static void main(String[] args) {
		//2차원 반복문 심화2문제
		/*
		 * # 나만의 마블
		 * 옷 □ □ □ □ 
		 * □ ■ ■ ■ □ 
		 * □ ■ ■ ■ □ 
		 * □ ■ ■ ■ □ 
		 * □ □ □ □ □
		 */
		
		// 옷이 이동숫자를 입력받을때마다 이동 하는데 
		// 외각으로만 이동 아래그림참조 
		/*
		 * # 나만의 마블
		 * 옷 □ □ □ □ 
		 * □ ■ ■ ■ □ 
		 * □ ■ ■ ■ □ 
		 * □ ■ ■ ■ □ 
		 * □ □ □ □ □
		 */
		 //입력 ==> 3 
		/*
		 * # 나만의 마블
		 * □ □ □ 옷 □ 
		 * □ ■ ■ ■ □ 
		 * □ ■ ■ ■ □ 
		 * □ ■ ■ ■ □ 
		 * □ □ □ □ □
		 */
		 //입력 ==> 3 
		/*
		 * # 나만의 마블
		 * □ □ □ □ □ 
		 * □ ■ ■ ■ □ 
		 * □ ■ ■ ■ 옷 
		 * □ ■ ■ ■ □ 
		 * □ □ □ □ □
		 */
	}

}
